const data = [
  {
    أفلام: [
      {
        id: 1,
        question:
          "ما اسم الفيلم الذي قال فيه الفنان عادل إمام جملته الشهيرة: 'أنا كلت الجمبري؟'",
        options: ["اللمبي", "طيور الظلام", "أبو علي", "الناظر"],
        answer: "طيور الظلام",
      },
      {
        id: 2,
        question: "من هي بطلة فيلم 'عصابة حمادة وتوتو' مع الفنان عادل إمام؟",
        options: ["لبلبة", "منى زكي", "شادية", "نجلاء فتحي"],
        answer: "لبلبة",
      },
      {
        id: 3,
        question:
          "ما هو الفيلم الذي يحمل اسم إحدى أشهر أغاني المطرب عبد الحليم حافظ؟",
        options: ["صوت الحب", "أبي فوق الشجرة", "حكاية حب", "قلب حزين"],
        answer: "أبي فوق الشجرة",
      },
      {
        id: 4,
        question:
          "ما اسم الممثلة التي شاركت محمد هنيدي بطولة فيلم 'صعيدي في الجامعة الأمريكية'؟",
        options: ["هنا الزاهد", "منى زكي", "حنان مطاوع", "شيري عادل"],
        answer: "منى زكي",
      },
      {
        id: 5,
        question:
          "من هو الفنان الذي جسد شخصية 'الناظر صلاح الدين' في فيلم 'الناظر'؟",
        options: ["هاني رمزي", "أحمد حلمي", "علاء ولي الدين", "محمد سعد"],
        answer: "علاء ولي الدين",
      },
      {
        id: 6,
        question: "ما هو الاسم الحقيقي للفنان أحمد مكي في فيلم 'طير إنت'؟",
        options: ["محمود", "عمرو", "بهيج", "حسن"],
        answer: "بهيج",
      },
      {
        id: 7,
        question:
          "من هو المخرج المعروف الذي أخرج فيلم 'اللص والكلاب' لـ شكري سرحان؟",
        options: ["كمال الشيخ", "هشام شربتجي", "يوسف شاهين", "رضا عبد الله"],
        answer: "كمال الشيخ",
      },
      {
        id: 8,
        question: "ما هو اللقب الذي أُطلق على الفنانة شادية؟",
        options: [
          "أميرة الكوميديا",
          "دلوعة السينما",
          "نجمة الشرق",
          "ملكة الشاشة",
        ],
        answer: "دلوعة السينما",
      },
      {
        id: 9,
        question:
          "ما اسم الفيلم الذي جمع بين أحمد زكي و نجلاء فتحي وتدور أحداثه حول قصة حب في صعيد مصر؟",
        options: [
          "الراقصة والسياسي",
          "سواق الأتوبيس",
          "الزوجة الثانية",
          "البيه البواب",
        ],
        answer: "سواق الأتوبيس",
      },
      {
        id: 10,
        question:
          "في أي فيلم ظهرت الفنانة سعاد حسني بشخصية 'هويدا' المخطوبة من 'حسن'؟",
        options: ["الشقيقتان", "أهل القمة", "الحرام", "الزوجة الثانية"],
        answer: "الزوجة الثانية",
      },
      {
        id: 11,
        question:
          "ما اسم الفيلم الذي تدور أحداثه حول فتاة تعمل كـ 'ساحرة' لـ أحمد حلمي؟",
        options: [
          "مرجان أحمد مرجان",
          "آسف على الإزعاج",
          "بلبل حيران",
          "عريس من جهة أمنية",
        ],
        answer: "آسف على الإزعاج",
      },
      {
        id: 12,
        question: "من هو الفنان الذي قام ببطولة فيلم 'شمس الزناتي'؟",
        options: ["أحمد حلمي", "هاني رمزي", "عادل إمام", "محمد سعد"],
        answer: "عادل إمام",
      },
      {
        id: 13,
        question:
          "ما اسم الفيلم الذي أُنتج عام 1975 وهو من بطولة فريد شوقي و نور الشريف؟",
        options: ["الكيت كات", "الكرنك", "الرجل الآخر", "اللص والكلاب"],
        answer: "الكرنك",
      },
      {
        id: 14,
        question: "في أي فيلم ظهرت جملة 'يا عم إحنا بتوع الأتوبيس'؟",
        options: [
          "اللمبي",
          "عمارة يعقوبيان",
          "احنا بتوع الأتوبيس",
          "الراقصة والسياسي",
        ],
        answer: "احنا بتوع الأتوبيس",
      },
      {
        id: 15,
        question:
          "ما هو الفيلم الذي جمع بين محمد سعد و نيللي كريم وتم فيه استخدام جملة 'محيي الشرقاوي'؟",
        options: [
          "يا أنا يا خالتي",
          "بلبل حيران",
          "اللمبي",
          "مرجان أحمد مرجان",
        ],
        answer: "اللمبي",
      },
      {
        id: 16,
        question:
          "من هي الفنانة التي قامت بدور زوجة أحمد زكي في فيلم 'البيه البواب'؟",
        options: ["صفية العمري", "لبلبة", "شادية", "نجلاء فتحي"],
        answer: "صفية العمري",
      },
      {
        id: 17,
        question:
          "ما اسم الفيلم الذي تدور أحداثه حول فنان يتنكر في زي امرأة للعمل؟",
        options: [
          "أفواه وأرانب",
          "مرجان أحمد مرجان",
          "آسف على الإزعاج",
          "بلبل حيران",
        ],
        answer: "أفواه وأرانب",
      },
      {
        id: 18,
        question:
          "ما هو الفيلم الذي غنت فيه صباح أغنية 'مال الهوى يا عيني مالو' مع فريد الأطرش؟",
        options: [
          "العزيمة",
          "رسالة غرام",
          "دموع صاحبة القلب",
          "ليلى بنت الصحراء",
        ],
        answer: "رسالة غرام",
      },
      {
        id: 19,
        question: "ما اسم الكوميديان الذي قام ببطولة فيلم 'يا أنا يا خالتي'؟",
        options: ["محمد سعد", "محمد هنيدي", "أحمد حلمي", "هاني رمزي"],
        answer: "محمد هنيدي",
      },
      {
        id: 20,
        question: "ما اسم الفيلم الذي قام ببطولته عمرو دياب و شريهان؟",
        options: [
          "آيس كريم في جليم",
          "رمضان مبروك أبو العلمين حمودة",
          "كراكون في الجامعة",
          "حسن ومرقص",
        ],
        answer: "آيس كريم في جليم",
      },
    ],
  },

  {
    رياضة: [
      {
        id: 1,
        question:
          "كم عدد اللاعبين الأساسيين في فريق كرة القدم الأمريكية على أرض الملعب؟",
        options: ["10", "11 لاعبًا", "12", "9"],
        answer: "11 لاعبًا",
      },
      {
        id: 2,
        question:
          "ما هو الحد الأقصى لعدد الأشواط في مباراة كرة الطائرة الشاطئية؟",
        options: ["3 أشواط", "4 أشواط", "5 أشواط", "2 أشواط"],
        answer: "3 أشواط",
      },
      {
        id: 3,
        question:
          "ما هي الدولة الوحيدة التي شاركت في جميع بطولات كأس العالم لكرة القدم منذ انطلاقها؟",
        options: ["البرازيل", "إيطاليا", "الأرجنتين", "ألمانيا"],
        answer: "البرازيل",
      },
      {
        id: 4,
        question: "ما هو الاسم الحقيقي للملاكم الأسطوري محمد علي؟",
        options: [
          "كاسيوس مارسيلوس كلاي جونيور",
          "محمد علي باشا",
          "أحمد علي",
          "ماركوس كلاي",
        ],
        answer: "كاسيوس مارسيلوس كلاي جونيور",
      },
      {
        id: 5,
        question:
          "في أي رياضة تستخدم عصا تسمى 'الهوكي' وكرة صغيرة تسمى 'الباك'؟",
        options: ["هوكي الجليد", "هوكي العشب", "الكرة الحديدية", "البيسبول"],
        answer: "هوكي الجليد",
      },
      {
        id: 6,
        question: "كم نقطة يحصل عليها الفريق عند تسجيل رمية حرة في كرة السلة؟",
        options: ["نقطتان", "5 نقاط", "نقطة واحدة", "ثلاث نقاط"],
        answer: "نقطة واحدة",
      },
      {
        id: 7,
        question: "ما هي الرياضة التي تُعرف بأنها 'أم الألعاب'؟",
        options: ["ألعاب القوى", "السباحة", "كرة القدم", "الجمباز"],
        answer: "ألعاب القوى",
      },
      {
        id: 8,
        question: "كم يبلغ طول سباق الماراثون بالكيلومترات (تقريبًا)؟",
        options: ["50 كم", "42.195 كم", "40 كم", "45 كم"],
        answer: "42.195 كم",
      },
      {
        id: 9,
        question:
          "ما هو اللون الذي يمثل اللاعب الذي يحمل القميص في رياضة الجودو؟",
        options: ["الأزرق", "الأبيض", "الأسود", "الأحمر"],
        answer: "الأبيض",
      },
      {
        id: 10,
        question: "من هو النجم الذي فاز بأكبر عدد من كرات الذهب (البالون دور)؟",
        options: ["كريستيانو رونالدو", "ليونيل ميسي", "مارادونا", "بيليه"],
        answer: "ليونيل ميسي",
      },
      {
        id: 11,
        question:
          "ما هي الدولة التي فازت بأول بطولة لكأس العالم لكرة القدم عام 1930؟",
        options: ["البرازيل", "الأوروغواي", "الأرجنتين", "ألمانيا"],
        answer: "الأوروغواي",
      },
      {
        id: 12,
        question:
          "كم عدد الميداليات الذهبية التي فازت بها مصر في الألعاب الأولمبية عبر تاريخها؟",
        options: ["8", "12", "10", "5"],
        answer: "8",
      },
      {
        id: 13,
        question: "ما هي الأداة التي تستخدم لضرب الكرة في رياضة التنس؟",
        options: ["المضرب (Racket)", "الشبكة", "الملعب", "الكرة"],
        answer: "المضرب (Racket)",
      },
      {
        id: 14,
        question: "ما هي الرياضة التي تُقام فيها بطولة ويمبلدون الشهيرة؟",
        options: ["التنس", "كرة القدم", "كرة السلة", "الغولف"],
        answer: "التنس",
      },
      {
        id: 15,
        question: "كم عدد الحفر (Holes) التي يتكون منها ملعب الغولف القياسي؟",
        options: ["12", "18 حفرة", "9", "20"],
        answer: "18 حفرة",
      },
      {
        id: 16,
        question:
          "ما هو الاسم الذي يطلق على لاعب الكرة الذي يركض بسرعة عالية دون أن يتوقف؟",
        options: [
          "الكرة الطائرة",
          "العداء (Runner)",
          "المتسابق",
          "اللاعب السريع",
        ],
        answer: "العداء (Runner)",
      },
      {
        id: 17,
        question: "كم دقيقة هي مدة الشوط الواحد في كرة السلة للمحترفين (NBA)؟",
        options: ["12 دقيقة", "15", "10", "20"],
        answer: "12 دقيقة",
      },
      {
        id: 18,
        question: "ما هو نادي كرة القدم الذي يُلقب بـ 'الملكي'؟",
        options: ["ريال مدريد", "برشلونة", "بايرن ميونخ", "مانشستر يونايتد"],
        answer: "ريال مدريد",
      },
    ],
  },

  {
    حيوانات: [
      {
        id: 1,
        question: "ما هو أطول حيوان في العالم من حيث الرقبة؟",
        options: ["الفيل", "الحوت", "الدب", "الزرافة"],
        answer: "الزرافة",
      },
      {
        id: 2,
        question: "كم عدد القلوب التي يمتلكها حيوان الأخطبوط؟",
        options: ["3 قلوب", "1", "2", "4"],
        answer: "3 قلوب",
      },
      {
        id: 3,
        question: "ما هو اسم صغير الدب؟",
        options: ["ديسم", "شبل", "جرو", "صغير", "ديسم"],
        answer: "ديسم",
      },
      {
        id: 4,
        question: "ما هو الطائر الذي يستطيع الطيران إلى الخلف؟",
        options: ["الهدهد", "النسناس", "الطائر الطنان", "النعامة"],
        answer: "الطائر الطنان",
      },
      {
        id: 5,
        question: "ما هو الحيوان الوحيد الذي لا يستطيع القفز؟",
        options: ["الفيل", "الحصان", "الكلب", "القط"],
        answer: "الفيل",
      },
      {
        id: 6,
        question: "ما هو أسرع حيوان بري على وجه الأرض؟",
        options: ["الغزال", "الفهد (الشيتا)", "الأسد", "النمر"],
        answer: "الفهد (الشيتا)",
      },
      {
        id: 7,
        question: "ما هو الجزء في جسم الكلب الذي يتعرق منه؟",
        options: ["الأنف", "اللسان", "الأذن", "الكفوف"],
        answer: "الكفوف",
      },
      {
        id: 8,
        question: "ما هو الكائن البحري الذي يصنع اللؤلؤ؟",
        options: ["السمك", "السلطعون", "الإخطبوط", "المحار"],
        answer: "المحار",
      },
      {
        id: 9,
        question: "ما لون جلد الدب القطبي تحت فرائه الأبيض؟",
        options: ["أبيض", "أسود", "رمادي", "أزرق"],
        answer: "أسود",
      },
      {
        id: 10,
        question: "ما هو الحيوان الذي يقضي ما يقارب 90% من حياته نائمًا؟",
        options: ["الكوالا", "النمر", "الأسد", "الفيل"],
        answer: "الكوالا",
      },
      {
        id: 11,
        question: "كم عيناً تمتلك النحلة؟",
        options: [ "2", "3", "5","6"],
        answer: "5",
      },
      {
        id: 12,
        question: "ما اسم الحيوان الذي يستطيع العيش بدون ماء لفترة طويلة جداً؟",
        options: [ "الإبل","الجمل", "الفيل", "الحصان"],
        answer: "الجمل",
      },
      {
        id: 13,
        question: "ما هو الطائر الذي يرمز إلى حسن الحظ؟",
        options: ["طائر اللقلق", "الحمامة", "العصفور", "الغراب"],
        answer: "طائر اللقلق",
      },
      {
        id: 14,
        question: "ما هي المدة التي يمكن أن ينامها الحلزون بشكل متواصل؟",
        options: ["1 سنة", "6 أشهر", "5 سنوات", "3 سنوات"],
        answer: "3 سنوات",
      },
      {
        id: 15,
        question:
          "ما هو الحيوان الذي لديه القدرة على تحريك كل عين من عينيه بشكل مستقل؟",
        options: ["الحرباء", "الثعلب", "القط", "الكلب"],
        answer: "الحرباء",
      },
      {
        id: 16,
        question: "ما هو الاسم الذي يُطلق على مجموعة من الذئاب؟",
        options: [ "عائلة", "مجموعة", "قطيع", "سرب"],
        answer: "قطيع",
      },
    ],
  },
];
export default data;
